Revit 2026 API

# RebarShapeDrivenAccessorComputeDrivingCurves Method

---

Compute the driving curves.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public IList<Curve> ComputeDrivingCurves()
```
```vb
Public Function ComputeDrivingCurves As IList(Of Curve)
```
```cpp
public:
IList<Curve^>^ ComputeDrivingCurves()
```
```fsharp
member ComputeDrivingCurves : unit -> IList<Curve>
```

#### Return Value

IListCurve Returns an empty array if an error is encountered.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | This RebarShapeDrivenAccessor doesn't contain a valid rebar reference. |

The driving curves are the ones that appear in rebar sketch mode. They include lines and arcs that drive the shape, but exclude fillets, hooks and cranks. They always lie in a plane-- if the bar is 3D, these curves are a subset or a projection. They are also used for shape matching.

#### Reference

RebarShapeDrivenAccessor Class

Autodesk.Revit.DB.Structure Namespace